import sys

data = [10, 25, 5, -8, 30]

try:
    print("Начинаю обработку данных...")

    for number in data:
        if number < 0:
            # Найдена критическая проблема! Нажимаем "стоп-кран".
            print(f"Ошибка: В данных найдено недопустимое значение ({number}).")
            print("Завершаю работу скрипта.")
            sys.exit()  # <-- ВСЕ, ОСТАНОВКА!

        # Этот код выполнится только для корректных (положительных) чисел
        print(f"Обрабатываю число: {number}")

    # Эта строка кода никогда не будет выполнена,
    # потому что sys.exit() остановит программу раньше.
    print("Все данные успешно обработаны.")
finally:
    print("-" * 80)